<!--
 * @Description: 
 * @Author: 李昶
 * @Date: 2022-11-01 09:53:32
 * @LastEditors: 李昶
 * @LastEditTime: 2022-11-01 17:17:02
 * @Profile: 一个比较废柴的前端开发
-->
<template>
    <div class="basic-06-wrapper article-wrapper">
        <h2 class="project__title article-title">类型系统</h2>
        <p>
            类型系统很大程度上塑造了语言的用户体验以及程序的安全性。为什么这么说？因为，在机器码的世界中，没有类型而言，指令仅仅和立即数或者内存打交道，内存中存放的数据都是字节流。类型系统完全是一种工具，编译器在编译时对数据做静态检查，或者语言在运行时对数据做动态检查的时候，来保证某个操作处理的数据是开发者期望的数据类型。
        </p>
        <h3 class="project__title">类型系统基本概念与分类</h3>
        <p>
            类型，是对值的区分，它包含了值在内存中的长度、对齐以及值可以进行的操作等信息。类型系统其实就是，对类型进行定义、检查和处理的系统。按定义后类型是否可以隐式转换，可以分为强类型和弱类型。Rust不同类型间不能自动转换，所以是强类型语言，而C/C++/JavaScript会自动转换，是弱类型语言。
        </p>
        <p>
            按类型检查的时机，在编译时检查还是运行时检查，可以分为静态类型系统和动态类型系统。对于静态类型系统，还可以进一步分为显式静态和隐式静态，Rust/Java/Swift等语言都是显式静态语言，而Haskell是隐式静态语言。
        </p>
        <p>在类型系统中，多态是一个非常重要的思想，它是指在使用相同的接口时，不同类型的对象，会采用不同的实现。</p>
        <p>
            对于动态类型系统，多态通过鸭子类型（duck typing）实现；而对于静态类型系统，多态可以通过参数多（parametric
            polymorphism）、特设多态（adhoc polymorphism）和子类型多态（subtype polymorphism）实现。
        </p>
        <ul>
            <li>参数多态是指，代码操作的类型是一个满足某些约束的参数，而非具体的类型。</li>
            <li>
                特设多态是指同一种行为有多个不同实现的多态。比如加法，可以1+1，也可以是“abc”+“cde”、matrix1+matrix2、甚至matrix1+vector1。在面向对象编程语言中，特设多态一般指函数的重载。
            </li>
            <li>子类型多态是指，在运行时，子类型可以被当成父类型使用。</li>
        </ul>
        <p></p>
        <p>在Rust中，参数多态通过泛型来支持、特设多态通过trait来支持、子类型多态可以用trait object来支持。</p>
        <img src="../../assets/img/15.png" width="800" />
        <h3 class="project__title">Rust类型系统</h3>
        <p>
            按不同阶段的分类，在定义时，Rust不允许类型的隐式转换，也就是说，Rust是强类型语言；同时在检查时，Rust使用了静态类型系统，在编译期保证类型的正确。强类型加静态类型，使得Rust是一门类型安全的语言。从内存的角度看，类型安全是指代码，只能按照被允许的方法，访问它被授权访问的内存。
        </p>
        <p>
            在此基础上，Rust还进一步对内存的访问进行了读/写分开的授权。所以，Rust下的内存安全更严格：代码只能按照被允许的方法和被允许的权限，访问它被授权访问的内存。为了做到这么严格的类型安全，Rust中除了let/fn/static/const
            这些定义性语句外，都是表达式，而一切表达式都有类型，所以可以说在Rust中，类型无处不在。
        </p>
        <p>
            在Rust中，对于一个作用域，无论是if/else/for循环，还是函数，最后一个表达式的返回值就是作用域的返回值，如果表达式或者函数不返回任何值，那么它返回一个unit()。unit是只有一个值的类型，它的值和类型都是()。
        </p>
        <p>
            unit的应用非常广泛，除了作为返回值，它还被大量使用在数据结构中，比如Result&lt;(),Error&gt;表示返回的错误类型中，我们只关心错误，不关心成功的值，再比如HashSet实际上是HashMap的一个类型别名。作为静态类型语言，Rust提供了大量的数据类型，但是在使用的过程中，进行类型标注是很费劲的，所以Rust类型系统贴心地提供了类型推导。
        </p>
        <p>
            而对比动态类型系统，静态类型系统还比较麻烦的是，同一个算法，对应输入的数据结构不同，需要有不同的实现，哪怕这些实现没有什么逻辑上的差异。对于这些问题可以使用泛型（参数多态）。
        </p>
        <h3 class="project__title">数据类型</h3>
        <p>
            Rust的原生类型包括字符、整数、浮点数、布尔值、数组（array）、元组（tuple）、切片（slice）、指针、引用、函数等
        </p>
        <img src="../../assets/img/16.png" width="1200" />
        <p>在原生类型的基础上，Rust 标准库还支持非常丰富的组合类型</p>
        <img src="../../assets/img/17.png" width="1200" />
    </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
    name: '06BasicPage',
});
</script>

<style scoped lang="scss"></style>
