<!--
 * @Description: 
 * @Author: 李昶
 * @Date: 2022-09-28 15:03:17
 * @LastEditors: 李昶
 * @LastEditTime: 2022-09-28 17:28:15
 * @Profile: 一个比较废柴的前端开发
-->
<template>
    <div class="basic-wrapper article-wrapper">
        <h2 class="article-title project__title">需要了解的基本概念</h2>
        <p>
            编程开发中经常接触到的其它基本概念。需要掌握的小概念点比较多，为了方便你学习，我把它们分为四大类来讲解：数据（值和类型、指针和引用）、代码（函数、方法、闭包、接口和虚表）、运行方式（并发并行、同步异步和
            Promise / async / await ），以及编程范式（泛型编程）。
        </p>
        <img src="@/assets/img/5.png" />
        <h3 class="project__title">数据</h3>
        <p>数据是程序操作的对象，不进行数据处理的程序是没有意义的。</p>
        <h3 class="project__title">值和类型</h3>
        <p>
            严谨地说，类型是对值的区分，它包含了值在内存中的长度、对齐以及值可以进行的操作等信息。一个值是符合一个特定类型的数据的某个实体。比如
            64u8，它是 u8 类型，对应一个字节大小、取值范围在 0～255 的某个整数实体，这个实体是
            64。值以类型规定的表达方式（representation）被存储成一组字节流进行访问。比如 64，存储在内存中的表现形式是
            0x40，或者 0b 0100 0000。这里要注意，值是无法脱离具体的类型讨论的。同样是内存中的一个字节 0x40，如果其类型是
            ASCII char，那么其含义就不是 64，而是 @
            符号。不管是强类型的语言还是弱类型的语言，语言内部都有其类型的具体表述。一般而言，编程语言的类型可以分为原生类型和组合类型两大类。
        </p>
        <p>
            原生类型（primitive
            type）是编程语言提供的最基础的数据类型。比如字符、整数、浮点数、布尔值、数组（array）、元组（tuple）、指针、引用、函数、闭包等。所有原生类型的大小都是固定的，因此它们可以被分配到栈上。
        </p>
        <p>
            组合类型（composite
            type）或者说复合类型，是指由一组原生类型和其它类型组合而成的类型。组合类型也可以细分为两类：
        </p>
        <ul>
            <li>
                结构体（structure type）：多个类型组合在一起共同表达一个值的复杂数据结构。比如 Person 结构体，内部包含
                name、age、email 等信息。用代数数据类型（algebraic data type）的说法，结构体是 product type。
            </li>
            <li>
                标签联合（tagged union）：也叫不相交并集（disjoint
                union），可以存储一组不同但固定的类型中的某个类型的对象，具体是哪个类型由其标签决定。比如 Haskell 里的
                Maybe 类型，或者 Swift 中的 Optional 就是标签联合。用代数数据类型的说法，标签联合是 sum type。
            </li>
        </ul>
        <p></p>
        <p>
            另外不少语言不支持标签联合，只取其标签部分，提供了枚举类型（enumerate）。枚举是标签联合的子类型，但功能比较弱，无法表达复杂的结构。
        </p>
        <p>看定义可能不是太好理解，你可以看这张图：</p>
        <img src="@/assets/img/6.png" />
        <h3 class="project__title">指针和引用</h3>
        <p>
            在内存中，一个值被存储到内存中的某个位置，这个位置对应一个内存地址。而指针是一个持有内存地址的值，可以通过解引用（dereference）来访问它指向的内存地址，理论上可以解引用到任意数据类型。
        </p>
        <p>
            引用（reference）和指针非常类似，不同的是，引用的解引用访问是受限的，它只能解引用到它引用数据的类型，不能用作它用。比如，指向
            42u8 这个值的一个引用，它解引用的时候只能使用 u8 数据类型。
        </p>
        <p>
            所以，指针的使用限制更少，但也会带来更多的危害。如果没有用正确的类型解引用一个指针，那么会引发各种各样的内存问题，造成系统崩溃或者潜在的安全漏洞。
        </p>
        <p>指针和引用是原生类型，它们可以分配在栈上。</p>
        <p>根据指向数据的不同，某些引用除了需要一个指针指向内存地址之外，还需要内存地址的长度和其它信息。</p>
        <p>
            hello world” 字符串的指针，还包含字符串长度和字符串的容量，一共使用了 3 个 word，在 64 位 CPU 下占用 24
            个字节，这样比正常指针携带更多信息的指针，我们称之为胖指针（fat
            pointer）。很多数据结构的引用，内部都是由胖指针实现的。
        </p>
        <p>
            引用的访问只能解引用到它引用的数据类型，也就是说编译器会检查对引用的使用是否是类型是匹配合理的。而指针的就没有这样的限制，不会编译期间进行检查，使用灵活性更高，但也会有更多安全问题。在
            rust 里也只能在 unsafe code 中使用指针，常规都是使用引用。
        </p>
        <h3 class="project__title">代码</h3>
        <p>
            数据是程序操作的对象，而代码是程序运行的主体，也是我们开发者把物理世界中的需求转换成数字世界中逻辑的载体。
        </p>
        <h3 class="project__title">函数、方法和闭包</h3>
        <p>
            函数是编程语言的基本要素，它是对完成某个功能的一组相关语句和表达式的封装。函数也是对代码中重复行为的抽象。在现代编程语言中，函数往往是一等公民，这意味着函数可以作为参数传递，或者作为返回值返回，也可以作为复合类型中的一个组成部分。
        </p>
        <p>
            在面向对象的编程语言中，在类或者对象中定义的函数，被称为方法（method）。方法往往和对象的指针发生关系，比如
            Python 对象的 self 引用，或者 Java 对象的 this 引用。
        </p>
        <p>
            而闭包是将函数，或者说代码和其环境一起存储的一种数据结构。闭包引用的上下文中的自由变量，会被捕获到闭包的结构中，成为闭包类型的一部分。
        </p>
        <p>
            一般来说，如果一门编程语言，其函数是一等公民，那么它必然会支持闭包（closure），因为函数作为返回值往往需要返回一个闭包。
        </p>
        <h3 class="project__title">接口和虚表</h3>
        <p>
            接口是一个软件系统开发的核心部分，它反映了系统的设计者对系统的抽象理解。作为一个抽象层，接口将使用方和实现方隔离开来，使两者不直接有依赖关系，大大提高了复用性和扩展性。
        </p>
        <p>
            很多编程语言都有接口的概念，允许开发者面向接口设计，比如 Java 的 interface、Elixir 的 behaviour、Swift 的
            protocol 和 Rust 的 trait。
        </p>
        <p>
            比如说，在 HTTP 中，Request/Response
            的服务处理模型其实就是一个典型的接口，我们只需要按照服务接口定义出不同输入下，从 Request 到 Response
            具体该如何映射，通过这个接口，系统就可以在合适的场景下，把符合要求的 Request 分派给我们的服务。
        </p>
        <p>
            面向接口的设计是软件开发中的重要能力，而 Rust 尤其重视接口的能力。在后续讲到 Trait
            的章节，我们会详细介绍如何用 Trait 来进行接口设计。
        </p>
        <p>
            当我们在运行期使用接口来引用具体类型的时候，代码就具备了运行时多态的能力。但是，在运行时，一旦使用了关于接口的引用，变量原本的类型被抹去，我们无法单纯从一个指针分析出这个引用具备什么样的能力。
        </p>
        <p>
            因此，在生成这个引用的时候，我们需要构建胖指针，除了指向数据本身外，还需要指向一张涵盖了这个接口所支持方法的列表。这个列表，就是我们熟知的虚表（virtual
            table）。
        </p>
        <p>下图展示了一个 Vec 数据在运行期被抹去类型，生成一个指向 Write 接口引用的过程：</p>
        <img src="@/assets/img/7.png" />
        <p>由于虚表记录了数据能够执行的接口，所以在运行期，我们想对一个接口有不同实现，可以根据上下文动态分派。</p>
        <p>
            比如我想为一个编辑器的 Formatter
            接口实现不同语言的格式化工具。我们可以在编辑器加载时，把所有支持的语言和其格式化工具放入一个哈希表中，哈希表的
            key 为语言类型，value 为每种格式化工具 Formatter
            接口的引用。这样，当用户在编辑器打开某个文件的时候，我们可以根据文件类型，找到对应 Formatter
            的引用，来进行格式化操作。
        </p>
    </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
    name: 'basicPage',
});
</script>

<style scoped lang="scss"></style>
